core/src/main/resources/order_template/gonextstep.xml

<soapenv:Envelope xmlns:soapenv="http://schemas.xmlsoap.org/soap/envelope/"  xmlns:oed="http://tot.co.th/totom/interface/oedata"  xmlns:wsse="http://docs.oasis-open.org/wss/2004/01/oasis-200401-wss-wssecurity-secext-1.0.xsd"> 
   <soapenv:Body>
      <oed:SubmitRequest>
         <OrderId>delta</OrderId>
         <SourceSystemId>OMWEB</SourceSystemId>
         <OMOrderId>{0}</OMOrderId>
         <OrderUserId>{2}</OrderUserId>
         <OrderDateTime>{1}</OrderDateTime>
         <OrderType>NEXTSTEP</OrderType>
      </oed:SubmitRequest>
   </soapenv:Body>
</soapenv:Envelope>